Белгипрозем_2017/src/Catalogs/Инструкции/Инструкции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Инструкции</name>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМакетаТиповой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметИнструкции</name>
    <type>
      <types>CatalogRef.ПредметыИнструкций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстИнструкции</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
      <types>CatalogRef.ВидыВходящихДокументов</types>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВопросДеятельности</name>
    <type>
      <types>CatalogRef.ВопросыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьГрифДоступа</name>
    <type>
      <types>CatalogRef.ГрифыДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСостояниеДокумента</name>
    <type>
      <types>EnumRef.СостоянияДокументов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступНаЧтение</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.ГруппыПользователей</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнойОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УсловияОтображения</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.ВидыВнутреннихДокументов</types>
        <types>CatalogRef.ВидыВходящихДокументов</types>
        <types>CatalogRef.ВидыИсходящихДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеДокумента</name>
      <type>
        <types>EnumRef.СостоянияДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрифДоступа</name>
      <type>
        <types>CatalogRef.ГрифыДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>ВопросДеятельности</name>
      <type>
        <types>CatalogRef.ВопросыДеятельности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/Инструкции/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Если не введено ни одно условие, тогда создаем строку с пустыми значениями.
	Если УсловияОтображения.Количество() = 0 Тогда
		НоваяСтрока = УсловияОтображения.Добавить();
		НоваяСтрока.ВидДокумента = Неопределено;
		НоваяСтрока.СостояниеДокумента = Неопределено;
		НоваяСтрока.ГрифДоступа = Неопределено;
		НоваяСтрока.ВопросДеятельности = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
